merlorfer/esp32zigbee_coordinator/xkc_level_sensor/sdkconfig.defaults
# XKC Water Level Sensor - Zigbee End Device
# SDK Configuration Defaults

# Target
CONFIG_IDF_TARGET="esp32c6"

# Flash Size
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# USB Serial JTAG Console
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# mbedTLS
CONFIG_MBEDTLS_HARDWARE_AES=n
CONFIG_MBEDTLS_HARDWARE_MPI=n
CONFIG_MBEDTLS_HARDWARE_SHA=n
CONFIG_MBEDTLS_CMAC_C=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_KEY_EXCHANGE_ECJPAKE=y
CONFIG_MBEDTLS_ECJPAKE_C=y

# Zboss - End Device
CONFIG_ZB_ENABLED=y
CONFIG_ZB_ZED=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Log Level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# Stack Sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# Compiler Optimization
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
